list_dir= { 
    
    'data_root_dir': r'C:\Users\Amzad\Desktop\news_classifcation\data\pre-processed-data',
    'data_dir': r'C:\Users\Amzad\Desktop\news_classifcation\data\pre-processed-data\data_with_15%_no_label.csv',
    'ml_model_ckpt_dir': r"C:\Users\Amzad\Desktop\news_classifcation\project\logs\model_ckpts",
    'all_news_dir': r"C:\Users\Amzad\Desktop\news_classifcation\data\pre-processed-data\all_new_label.csv",
}

# bert config 
simple_transformer_config = { 

    'reprocess_input_data': True,
    'use_cached_eval_features': False,
    'overwrite_output_dir': True,
    'num_train_epochs': 2,
    'silent': True,
    'output_dir': "/content/drive/MyDrive/news_data/bert_model", 

}
    


bert_model_config = { 
    'model_type': 'bert',
    'model_name': "sagorsarker/bangla-bert-base", 
    
    }

split_config={
    "test_size":0.5,
    "random_state":42
}


label_={'label_list': ['ক্রেডিট রেটিং', 'পর্ষদ সভা', 'ইপিএস', 'প্রান্তিক প্রকাশ', 
                       'পিই রেশিও', 'ডিভিডেন্ড', 'ব্লক মার্কেট', 'স্পট মার্কেট', 
                       'লভ্যাংশ ঘোষণা']}


pre_process_config={ 'stop_word': "অবশ্য অনেক অনেকে অনেকেই অন্তত অথবা অথচ অর্থাত অন্য আজ আছে আপনার আপনি আবার আমরা আমাকে আমাদের আমার আমি আরও আর আগে আগেই আই অতএব আগামী অবধি অনুযায়ী আদ্যভাগে এই একই একে একটি এখন এখনও এখানে এখানেই এটি এটা এটাই এতটাই এবং একবার এবার এদের এঁদের এমন এমনকী এল এর এরা এঁরা এস এত এতে এসে একে এ ঐ ই ইহা ইত্যাদি উনি উপর উপরে উচিত ও ওই ওর ওরা ওঁর ওঁরা ওকে ওদের ওঁদের ওখানে কত কবে করতে কয়েক কয়েকটি করবে করলেন করার কারও করা করি করিয়ে করার করাই করলে করলেন করিতে করিয়া করেছিলেন করছে করছেন করেছেন করেছে করেন করবেন করায় করে করেই কাছ কাছে কাজে কারণ কিছু কিছুই কিন্তু কিংবা কি কী কেউ কেউই কাউকে কেন কে কোনও কোনো কোন কখনও ক্ষেত্রে খুব	গুলি গিয়ে গিয়েছে গেছে গেল গেলে গোটা চলে ছাড়া ছাড়াও ছিলেন ছিল জন্য জানা ঠিক তিনি তিনঐ তিনিও তখন তবে তবু তাঁদের তাঁাহারা তাঁরা তাঁর তাঁকে তাই তেমন তাকে তাহা তাহাতে তাহার তাদের তারপর তারা তারৈ তার তাহলে তিনি তা তাও তাতে তো তত তুমি তোমার তথা থাকে থাকা থাকায় থেকে থেকেও থাকবে থাকেন থাকবেন থেকেই দিকে দিতে দিয়ে দিয়েছে দিয়েছেন দিলেন দু দুটি দুটো দেয় দেওয়া দেওয়ার দেখা দেখে দেখতে দ্বারা ধরে ধরা নয় নানা না নাকি নাগাদ নিতে নিজে নিজেই নিজের নিজেদের নিয়ে নেওয়া নেওয়ার নেই নাই পক্ষে পর্যন্ত পাওয়া পারেন পারি পারে পরে পরেই পরেও পর পেয়ে প্রতি প্রভৃতি প্রায় ফের ফলে ফিরে ব্যবহার বলতে বললেন বলেছেন বলল বলা বলেন বলে বহু বসে বার বা বিনা বরং বদলে বাদে বার বিশেষ বিভিন্ন	বিষয়টি ব্যবহার ব্যাপারে ভাবে ভাবেই মধ্যে মধ্যেই মধ্যেও মধ্যভাগে মাধ্যমে মাত্র মতো মতোই মোটেই যখন যদি যদিও যাবে যায় যাকে যাওয়া যাওয়ার যত যতটা যা যার যারা যাঁর যাঁরা যাদের যান যাচ্ছে যেতে যাতে যেন যেমন যেখানে যিনি যে রেখে রাখা রয়েছে রকম শুধু সঙ্গে সঙ্গেও সমস্ত সব সবার সহ সুতরাং সহিত সেই সেটা সেটি সেটাই সেটাও সম্প্রতি সেখান সেখানে সে স্পষ্ট স্বয়ং হইতে হইবে হৈলে হইয়া হচ্ছে হত হতে হতেই হবে হবেন হয়েছিল হয়েছে হয়েছেন হয়ে হয়নি হয় হয়েই হয়তো হল হলে হলেই হলেও হলো হিসাবে হওয়া হওয়ার হওয়ায় হন হোক জন জনকে জনের জানতে জানায় জানিয়ে জানানো জানিয়েছে জন্য জন্যওজে জে বেশ দেন তুলে ছিলেন চান চায় চেয়ে মোট যথেষ্ট টি ১ ২ ৩ ৪ ৫ ৬ ৭ ৮ ৯ একটি নিজের তারৈ আমি ঐ আপনি করিয়ে তত জন্য যখন হত সেটাও করার ওঁদের শুধু তাহার ওদের দেওয়ার নিজেই আমার দিলেন ফিরে গেলে জানা আপনার তাঁর উপর তাকে রয়েছে যাকে এঁরা তাদের সেই হবেন কোনও অনুযায়ী যান তাও পরেও গেছে অবধি কয়েকটি কাছে এটি আগেই এতটাই হইয়া যা হৈলে আবার তারা সে হয়েছে সহিত যাবে তখন গিয়েছে দিয়ে কিছুই তবে নিতে রেখে ই সহ যাঁরা নানা হলো যাঁর তোমার পর ছাড়াও করলে যত তবু তিনিও না দেখতে দেওয়া থেকেও কাজে ক্ষেত্রে কয়েক হচ্ছে হয়েছিল থেকেই অথবা সঙ্গেও বদলে দ্বারা পক্ষে গেল বলতে পাওয়া কত মধ্যে বলা জে নেই তাই কি সেটা একে যেখানে এত হলেও টি করেই করছে হন প্রায় মধ্যভাগে কারণ এবার করেছে করেন আর যেন নিজেদের হয়েই নিজে একবার নাই বাদে যাতে এর ঠিক তার ও পেয়ে করলেন মোট ব্যাপারে কাছ করা চেয়ে কেউ নাগাদ করি বলেছেন নেওয়ার কাউকে ভাবে দিকে তারপর যেমন ওখানে খুব	গুলি অর্থাত তো ছিলেন কোন পারেন হয়তো বরং কেউই জনকে প্রভৃতি দুটো তাঁকে এখন অন্য ওর ছিল ওকে তুলে দিয়েছে জানানো ওঁরা এটাই তুমি করিতে তাহলে দেন বলে যে হলেই এমনকী হল বহু বলল মধ্যেই ধরে তাঁদের তেমন আই হইবে তাহাতে নেওয়া যিনি এঁদের অনেকে হতে কে ধরা হইতে করায় ব্যবহার থাকে বসে থাকেন থাকবে স্বয়ং এরা দেয় নিয়ে কবে সবার দেখে চলে যেতে ইত্যাদি সেখান চান অন্তত হবে সেটাই পর্যন্ত মাধ্যমে এমন ভাবেই দিয়েছেন ওরা করে তাতে এবং এতে ইহা জন্যওজে সুতরাং আমাকে বিশেষ এসে করতে এখানেই আমরা কিন্তু তিনি বিনা আজ কারও করিয়া তা ছাড়া থেকে যারা হয় হওয়া এল মাত্র ফের জানতে জানিয়ে বললেন মতোই সাথে কর করেছেন করবেন হলে নাকি সঙ্গে আগামী এখনও তাঁাহারা দিতে তাঁরা আগে আমাদের সেটি বলেন স্পষ্ট কোনো হোক থাকবেন জন করছেন অবশ্য গিয়ে হয়নি এখানে করবে কিছু হওয়ায় কখনও যাদের বার হয়ে পারি জানিয়েছে আদ্যভাগে আরও মতো যায় যাওয়ার কিংবা যদি পরেই জনের হিসাবে এস দুটি জানায় গোটা যাওয়া তথা সমস্ত যদিও করাই হতেই হয়েছেন নয় বিভিন্ন	বিষয়টি রকম অনেক করেছিলেন উপরে এ এদের উনি হয় সব পরে প্রতি যার মধ্যেও মোটেই এই বা বেশ পারে যতটা অনেকেই যাচ্ছে অথচ অতএব একই দেখা চায় আছে থাকায় যথেষ্ট কী তাহা রাখা ওঁর সেখানে সম্প্রতি তিনঐ উচিত হওয়ার ফলে ওই কেন থাকা এটা",
                    'seed': 42, # seed for random number generator
                    }
lebeling_config= { 'dataset_name': 'dataset_name', 
                  'dataset_path': 'dataset_path',
                  'save_pathe': r"C:\Users\Amzad\Desktop\news_classifcation\data\pre-processed-data/",}

new_label_flg=False # if you want to add new label then set True        
num_labels=len(label_['label_list']) # number of label